Revit 2026 API

# TopographySurfaceCreate(Document, IListXYZ) Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")]
public static TopographySurface Create(
	Document document,
	IList<XYZ> points
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")>
Public Shared Function Create (
	document As Document,
	points As IList(Of XYZ)
) As TopographySurface
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")]
static TopographySurface^ Create(
	Document^ document,
	IList<XYZ^>^ points
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")>]
static member Create :
        document : Document *
        points : IList<XYZ> -> TopographySurface
```

#### Parameters

document Document

points IListXYZ

#### Return Value

TopographySurface

#### Reference

TopographySurface Class

Create Overload

Autodesk.Revit.DB.Architecture Namespace